# Тут собраны все текстовые переменные
# Приветствие
first_msg = "Привет, это второе задание вездекода\n\n Я тут позадаю вопросики✨"

# Основной блок меню:
question_go = "Перейти к вопросам"
faq = "FAQ"

# Возвращения
back = "Назад"
im_back = "Возвращаюсь"

# Месенджи для основного блока меню
question_go_msg = "В этом разделе представляется выбор, как ответить на вопросы:"
faq_msg = "Мы молодая команда DEK, которая создала этого чат-бота :)"

# Меню для перехода к вопросам
lisl_question = "Вопросы списком"
poshagovo_question = "Вопросы пошагово"

# Месенджи для перехода к вопросам
lisl_question_msg = "Выбирай задания :)"
poshagovo_question_msg = "Переходи к первому заданию :)"

# Для вопросы списком
vopros_1 = "Вопрос №1"
vopros_2 = "Вопрос №2"
vopros_3 = "Вопрос №3"
vopros_4 = "Вопрос №4"
vopros_5 = "Вопрос №5"
vopros_6 = "Вопрос №6"
vopros_7 = "Вопрос №7"
vopros_8 = "Вопрос №8"

vopros_1_msg = "В каком году появилась компания Вконтакте?"
vopros_1_1 = "10 октября 2006 г."  # True
vopros_1_2 = "15 марта 2011 г."
vopros_1_3 = "10 октября 2007 г."
vopros_1_4 = "19 сентрября 2019 г."

vopros_1_t = "Вы решили правильно!"
vopros_1_f = "Вы решили неверно!"

vopros_2_msg = "Какая ежемесячная аудитория Вконтакте?"
vopros_2_1 = "52 млн"
vopros_2_2 = "30 млн"
vopros_2_3 = "85 млн"
vopros_2_4 = "Более 100 млн"  # True

vopros_2_t = "Вы решили правильно!"
vopros_2_f = "Вы решили неверно!"

vopros_3_msg = "На скольких языках существует Вконтакте?"
vopros_3_1 = "72"
vopros_3_2 = "86"  # True
vopros_3_3 = "36"
vopros_3_4 = "17"

vopros_3_t = "Вы решили правильно!"
vopros_3_f = "Вы решили неверно!"

vopros_4_msg = "Изначально соц сеть задумывалась, как?"
vopros_4_1 = "Студенческая"  # True
vopros_4_2 = "Социальная сеть"
vopros_4_3 = "Торговая площадка"
vopros_4_4 = "Платформа для видео"

vopros_4_t = "Вы решили правильно!"
vopros_4_f = "Вы решили неверно!"

vopros_5_msg = "Есть ли у Вконтакте свой мерч?"
vopros_5_1 = "Да, безусловно"  # True
vopros_5_2 = "Нет"
vopros_5_3 = "В разработке"
vopros_5_4 = "Бесполезная штука"

vopros_5_t = "Вы решили правильно!"
vopros_5_f = "Вы решили неверно!"

vopros_6_msg = "Можно послушать музыку в Вконтакте?"
vopros_6_1 = "Нет"
vopros_6_2 = "Конечно можно"  # True
vopros_6_3 = "Эту фишку убрали давно"
vopros_6_4 = "Пока в разработке"

vopros_6_t = "Вы решили правильно!"
vopros_6_f = "Вы решили неверно!"

vopros_7_msg = "Можно ли попасть на работу в Вконтакте по it направлению?"
vopros_7_1 = "Можно, если есть опыт и знания"  # True
vopros_7_2 = "Нет, нельзя"
vopros_7_3 = "Все вакансии заняты"
vopros_7_4 = "Там работают роботы :)"

vopros_7_t = "Вы решили правильно!"
vopros_7_f = "Вы решили неверно!"

vopros_8_msg = "Что находится на вершине пирамиды Маслоу?"
vopros_8_1 = "Потребность в самоактуализации"  # True
vopros_8_2 = "Звезда"
vopros_8_3 = "Шпиль"
vopros_8_4 = "Потребность в безопасности"

vopros_8_t = "Вы решили правильно!"
vopros_8_f = "Вы решили неверно!"

# Для пошаговых вопросов
go_q = "Пошаговые вопросы"
vopros_1_p_msg = "В каком году появилась компания Vkontakte?"
vopros_1_1_p = "10 октября 2006 года"  # True
vopros_1_2_p = "15 марта 2011 года"
vopros_1_3_p = "10 октября 2007 года"
vopros_1_4_p = "19 сентрября 2019 года"

vopros_1_t_p = "Вы решили верно!"
vopros_1_f_p = "Вы решили неправильно!"

vopros_2_p_msg = "Какая ежемесячная аудитория Vkontakte?"
vopros_2_1_p = "52 миллиона"
vopros_2_2_p = "30 миллиона"
vopros_2_3_p = "85 миллиона"
vopros_2_4_p = "Более 100 миллионов"  # True

vopros_2_t_p = "Вы решили верно!"
vopros_2_f_p = "Вы решили неправильно!"

vopros_3_p_msg = "На скольких языках существует Vkontakte?"
vopros_3_1_p = "72 языка"
vopros_3_2_p = "86 языков"  # True
vopros_3_3_p = "36 языков"
vopros_3_4_p = "17 языков"

vopros_3_t_p = "Вы решили верно!"
vopros_3_f_p = "Вы решили неправильно!"

vopros_4_p_msg = "Изначально социальная сеть задумывалась, как?"
vopros_4_1_p = "Студенческая платформа"  # True
vopros_4_2_p = "Социальная сеть vk"
vopros_4_3_p = "Торговая площадка, маркетплейс"
vopros_4_4_p = "Платформа для видеороликов"

vopros_4_t_p = "Вы решили верно!"
vopros_4_f_p = "Вы решили неправильно!"

vopros_5_p_msg = "Есть ли у Vkontakte свой мерч?"
vopros_5_1_p = "Да, конечно"  # True
vopros_5_2_p = "Нет и не было"
vopros_5_3_p = "В разработке, скоро"
vopros_5_4_p = "Бессмысленная штука"

vopros_5_t_p = "Вы решили верно!"
vopros_5_f_p = "Вы решили неправильно!"

vopros_6_p_msg = "Можно послушать музыку в Vkontakte?"
vopros_6_1_p = "Нет, нельзя"
vopros_6_2_p = "Безусловно, можно"  # True
vopros_6_3_p = "Эту функцию убрали давно"
vopros_6_4_p = "Еще в разработке"

vopros_6_t_p = "Вы решили верно!"
vopros_6_f_p = "Вы решили неправильно!"

vopros_7_p_msg = "Можно ли попасть на работу в Vkontakte по it направлению?"
vopros_7_1_p = "Можно, если есть умения и знания"  # True
vopros_7_2_p = "Нельзя"
vopros_7_3_p = "Вакансии заняты"
vopros_7_4_p = "Там работают секретные агенты :)"

vopros_7_t_p = "Вы решили верно!"
vopros_7_f_p = "Вы решили неправильно!"

vopros_8_p_msg = "Что находится на вершине пирамиды Маслоу? :)"
vopros_8_1_p = "Потребность в самоактуализации!"  # True
vopros_8_2_p = "Звезда!"
vopros_8_3_p = "Шпиль!"
vopros_8_4_p = "Потребность в личной безопасности!"

vopros_8_t_p = "Вы решили верно!"
vopros_8_f_p = "Вы решили неправильно!"







